In [2]:
import pandas as pd
print("Setup complete")

Setup complete

In [3]:
ser = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [4]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
# Selectionner une valeur par son index
ser['c']

3

In [6]:
# verifier qu'une valeur est dans la série
'b' in ser

True

In [7]:
# Obtenir une valeur si elle est dans la série, sinon "inconnu"
display(ser.get('a','inconnu'))
display(ser.get('z','inconnu'))

1

'inconnu'

In [9]:
# Obtenir les index / clés
ser.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
# Obtenir les paires de clé valeurs
list(ser.items())

[('a', 1), ('b', 2), ('c', 3), ('d', 4), ('e', 5)]

In [11]:
# definir une valeur par son index
ser['e'] = 11
ser

a     1
b     2
c     3
d     4
e    11
dtype: int64

In [14]:
ser[(ser > 1) & (ser < 11)]

b    2
c    3
d    4
dtype: int64

In [15]:
ser[['a','e']]

a     1
e    11
dtype: int64

In [16]:
ser = pd.Series(['a','b','c','d'],index=[1,3,5,7])

In [17]:
ser[1]

'a'

In [19]:
# utilise l'index défini
ser.loc[1]

'a'

In [20]:
# utilise l'index défini
ser.loc[1]

'a'

In [21]:
pib = pd.Series({'US':1234.56,'JAP':3456.78,'CHI':8910.11,'ALL':1213.14,'UK':1516.17})

In [23]:
pibpop = pd.Series({'US':9876,'JAP':8765,'CHI':7654,'ALL':6543,'UK':5432})

In [24]:
pib_pop = pd.DataFrame({'pib/habitant':pibpop, 'pib':pib})

In [25]:
pib_pop

     pib/habitant      pib
US           9876  1234.56
JAP          8765  3456.78
CHI          7654  8910.11
ALL          6543  1213.14
UK           5432  1516.17

In [26]:
pib_pop['pib']

US     1234.56
JAP    3456.78
CHI    8910.11
ALL    1213.14
UK     1516.17
Name: pib, dtype: float64

In [27]:
pib_pop['population'] = (pib_pop['pib']*1000000) / pib_pop['pib/habitant']

In [28]:
pib_pop

     pib/habitant      pib    population
US           9876  1234.56  1.250061e+05
JAP          8765  3456.78  3.943845e+05
CHI          7654  8910.11  1.164112e+06
ALL          6543  1213.14  1.854104e+05
UK           5432  1516.17  2.791182e+05

In [29]:
pib_pop.values

array([[   9876.        ,    1234.56      ,  125006.07533414],
       [   8765.        ,    3456.78      ,  394384.48374216],
       [   7654.        ,    8910.11      , 1164111.57564672],
       [   6543.        ,    1213.14      ,  185410.36221917],
       [   5432.        ,    1516.17      ,  279118.18851252]])

In [30]:
# transposer
pib_pop.T

,US,JAP,CHI,ALL,UK
pib/habitant,9876.000000,8765.000000,7.654000e+03,6543.000000,5432.000000
pib,1234.560000,3456.780000,8.910110e+03,1213.140000,1516.170000
population,125006.075334,394384.483742,1.164112e+06,185410.362219,279118.188513

In [51]:
# uniquement certaines colonnes
# [row, cols]
# [start:end, start:end]
pib_pop.T.iloc[2:3,2:4]

                     CHI            ALL
population  1.164112e+06  185410.362219

In [57]:
pib_pop.T.loc['pib/habitant':'pib', 'JAP':'CHI']

                  JAP      CHI
pib/habitant  8765.00  7654.00
pib           3456.78  8910.11

In [59]:
pib_pop[pib_pop['population']>1000000]

     pib/habitant      pib    population
CHI          7654  8910.11  1.164112e+06

In [8]:
# remplacer une ou des valeurs
df = pd.DataFrame({'X': [1, 2, 3, 4, 5],
                   'Y': [5, 6, 7, 8, 9],
                   'Z': ['z', 'y', 'x', 'w', 'v']})
df

   X  Y  Z
0  1  5  z
1  2  6  y
2  3  7  x
3  4  8  w
4  5  9  v

In [8]:
df = df.replace(to_replace=2, value=20)
df

    X  Y  Z
0   1  5  z
1  20  6  y
2   3  7  x
3   4  8  w
4   5  9  v

In [10]:
df['X'].replace(to_replace=20, value=2)

0    1
1    2
2    3
3    4
4    5
Name: X, dtype: int64

In [12]:
# supprimer des lignes en fonction d'une valeur
import pandas as pd
fruit_list = [ ('Orange', 34, 'Yes' ) ,
             ('Mango', 24, 'No' ) ,
             ('banana', 14, 'No' ) ,
             ('Apple', 44, 'Yes' ) ,
             ('Pineapple', 64, 'No') ,
             ('Kiwi', 84, 'Yes')  ]
#Create a DataFrame object
df = pd.DataFrame(fruit_list, columns = 
                  ['Name' , 'Price', 'Stock']) 

print("original : \n",df)

# Get names of indexes for which column Stock has value No
indexNames = df[ df['Stock'] == 'No' ].index

# Delete these row indexes from dataFrame
df.drop(indexNames , inplace=True)

print("updated : \n",df)

original :
         Name  Price Stock
0     Orange     34   Yes
1      Mango     24    No
2     banana     14    No
3      Apple     44   Yes
4  Pineapple     64    No
5       Kiwi     84   Yes
updated :
      Name  Price Stock
0  Orange     34   Yes
3   Apple     44   Yes
5    Kiwi     84   Yes

In [14]:
# max d'une colonne
import pandas as pd
fruit_list = [ ('Orange', 34, 'Yes' ) ,
             ('Mango', 24, 'No' ) ,
             ('banana', 14, 'No' ) ,
             ('Apple', 44, 'Yes' ) ,
             ('Pineapple', 64, 'No') ,
             ('Kiwi', 84, 'Yes')  ]
#Create a DataFrame object
df = pd.DataFrame(fruit_list, columns = 
                  ['Name' , 'Price', 'Stock']) 
df['Price'].max()

84

In [9]:
# trier les valeurs
df.sort_values(by=['brand'],inplace=True)

KeyError: 'brand'

In [10]:
# uniquement certaines colonnes
# [row, cols]
# [start:end, start:end]
df.T.iloc[2:3,2:4]

   2  3
Z  x  w

In [30]:
# transposer
pib_pop.T

,US,JAP,CHI,ALL,UK
pib/habitant,9876.000000,8765.000000,7.654000e+03,6543.000000,5432.000000
pib,1234.560000,3456.780000,8.910110e+03,1213.140000,1516.170000
population,125006.075334,394384.483742,1.164112e+06,185410.362219,279118.188513